Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: After you do that, your commit history will contain both the C4 and C4' commits, which have different SHA-1 hashes but introduce the same work and have the same commit message.
es: Tras todo esto, tu registro de confirmaciones de cambio (commit history) contendrá tanto la confirmación C4 como la C4'; teniendo ambas el mismo contenido y el mismo mensaje de confirmación.

source: Insert 18333fig0501.png Figure 5-1.
es: Insert 18333fig0501.png Figura 5-1.

source: Create a branch to add the hotfix.
es: Creas una nueva rama para el problema crítico y lo resuelves trabajando en ella.

source: You can also run `git stash pop` to apply the stash and then immediately drop it from your stack.
es: También es posible utilizar el comando `git stash pop`, que aplica cambios de un guardado y lo retira inmediatamente de la pila.

source: If you run `git status`, you can see your dirty state:
es: Al lanzar el comando 'git status', se podría observar un estado inconsistente tal como:

source: ### Colors in Git ###
es: ### Colores en Git ###

source: Splitting a commit undoes a commit and then partially stages and commits as many times as commits you want to end up with.
es: Dividir una confirmación de cambios (commit), implica deshacerla y luego volver a preparar y confirmar trozos de la misma tantas veces como nuevas confirmaciones se desean tener al final.

source: The command is `filter-branch`, and it can rewrite huge swaths of your history, so you probably shouldn’t use it unless your project isn’t yet public and other people haven’t based work off the commits you’re about to rewrite.
es: El comando en cuestión es `filter-branch`, y permite reescribir automáticamente grandes porciones del historial. Precisamente por ello, no debería utilizarse a no ser que el proyecto aún no se haya hecho público (es decir, otras personas no han basado su trabajo en alguna de las confirmaciones de cambio que se van a modificar).

source: It takes the same stdin data as the `pre-receive` hook.
es: Recibe los mismos datos que 'pre-receive' desde la entrada estandar.

source: In order for a repository to be served over the Git protocol, you must create the `git-export-daemon-ok` file — the daemon won’t serve a repository without that file in it — but other than that there is no security.
es: Para que un repositorio pueda exponerse a través del protocolo Git, tienes que crear en él un archivo 'git-export-daemon-ok'; sin este archivo, el demonio no hará disponible el repositorio. Pero, aparte de esto, no hay ninguna otra medida de seguridad.

source: To see a full diff of what would happen if you were to merge this topic branch with another branch, you may have to use a weird trick to get the correct results.
es: Para ver plenamente todas las diferencias y lo que sucederá realmente si fusionas esta rama puntual con otra rama, tendrás que utilizar un pequeño truco para obtener los resultados correctos.

source: If, on the other hand, you want to see the opposite — all commits in `master` that aren’t in `experiment` — you can reverse the branch names.
es: Si, por el contrario, se desea ver lo opuesto (todas las confirmaciones en 'master' que no están en 'experiment'). Simplemente hay que invertir los nombres de las ramas.

source: This means the version in HEAD (your master branch, because that was what you had checked out when you ran your merge command) is the top part of that block (everything above the `=======`), while the version in your `iss53` branch looks like everything in the bottom part.
es: Donde nos dice que la versión en HEAD (la rama 'master', la que habias activado antes de lanzar el comando de fusión), contiene lo indicado en la parte superior del bloque (todo lo que está encima de '======='). Y que la versión en 'iss53' contiene el resto, lo indicado en la parte inferior del bloque.

source: Git automatically identifies the best common-ancestor merge base for branch merging.
es: Git identifica automáticamente el mejor ancestro común para realizar la fusión de las ramas.

source: It may be easier to remember the `~3` because you’re trying to edit the last three commits; but keep in mind that you’re actually designating four commits ago, the parent of the last commit you want to edit:
es: La nomenclatura `~3` es la mas sencilla de recordar, porque lo que se desea es modificar las tres últimas confirmaciones. Pero sin perder de vista que realmente se está señalando a cuatro confirmaciones de cambio más atras, al padre de la última de las confirmaciones de cambio a modificar.

source: There are two groups of these hooks: client side and server side.
es: Hay dos grupos de esos puntos de lanzamiento: los del lado cliente y los del lado servidor.

source: This will give you an idea of what is involved.
es: Así podrás hacerte una idea de cómo suelen funcionar estos alberges externos.

source: Your first line starts with 005b, which is 91 in hex, meaning that 91 bytes remain on that line.
es: La primera de las lineas comienza con 005b, 91 en decimal, indicandonos que hay 91 bytes más en esa línea.

source: You’ve accomplished the basic tasks of tracking and committing files, and you’ve harnessed the power of the staging area and lightweight topic branching and merging.
es: Se han visto las tareas básicas de seguimiento y confirmación de cambios en archivos. Aprovechando las capacidades del área de preparación (staging area), de las ramas (branches) y de los mecanismos de fusión (merging).

source: Are all the patches peer-reviewed and approved?
es: ¿Se revisan y aprueban los parches entre los propios desarrolladores?.

source: Now that it knows the server’s state, your `send-pack` process determines what commits it has that the server doesn’t.
es: Con esta información, el proceso `send-pack` ya puede determnar las confirmaciones de cambios (commits) presentes en el servidor.

source: If you’re doing the fetch over SSH, `fetch-pack` instead runs something like this:
es: Si en lugar de utilizar el demonio Git, estás utilizando el protocolo SSH. `fetch-pack` lanzará algo como esto:

source: The name of the file in `keydir` (in the previous example, `scott.pub`) will be different for you — Gitosis takes that name from the description at the end of the public key that was imported with the `gitosis-init` script.
es: El nombre del archivo en la carpeta 'keydir' ('scott.pub' en el ejemplo), puede ser diferente en tu instalación, (Gitosis lo obtiene a partir de la descripción existente al final de la clave pública que haya sido importada con el script 'gitosis-init').

source: Next, suppose your loss was for some reason not in the reflog — you can simulate that by removing `recover-branch` and deleting the reflog.
es: A continuación, supongamos que la pérdida se ha producido por alguna razón que no se refleja en el registro (reflog). Puedes simularlo borrando la rama `recover-branch` y borrando asimismo el registro.

source: Now, you need to set up a filter in Git (call it `dater`) and tell it to use your `expand_date` filter to smudge the files on checkout.
es: Tras ello, has de poner un filtro en Git (podemos llamarle 'dater'), e indicarle que use el filtro 'expand_date' para manchar (smudge) los archivos al extraerlos (checkout).

source: Now that your work is merged in, you have no further need for the `iss53` branch.
es: Ahora que todo tu trabajo está ya fusionado con la rama principal, ya no tienes necesidad de la rama 'iss53'.

source: Occasionally, you may have to do some cleanup — make a repository more compact, clean up an imported repository, or recover lost work.
es: De vez en cuando, es posible que necesites hacer algo de limpieza, (compactar un repositorio, adecuar un repositorio importado, recuperar trabajo perdido,...).

source: When you commit, it looks like you have all the Rack files under that subdirectory — as though you copied them in from a tarball.
es: Cuando se confirman estos cambios, es como si se tuvieran todos los archivos Rack bajo esa carpeta --como si se hubieran copiado desde un archivo comprimido tarball--

source: In other words, use commands.
es: Es decir, dá órdenes.

source: At this point, the topics are evaluated to determine whether they’re safe and ready for consumption or whether they need more work.
es: En un momento dado, las funcionalidades introducidas se evaluan; comprobando si son seguras y si están preparadas para los consumidores; o si, por el contrario, necesitan dedicarles más trabajo.

source: This setting was added in Git version 1.5.5; if you have an older version, you’ll have to specify all the color settings individually.
es: Este parámetro se añadió en la versión 1.5.5 de Git. Si tienes una versión más antigua, tendrás que indicar especificamente todos y cada uno de los colores individualmente.

source: The interactive rebase gives you a script that it’s going to run.
es: La reorganización interactiva lanza un script.

source: To get it running without having to reboot, you can run this:
es: Para arrancarlo sin necesidad de reiniciar la máquina, puedes utilizar el comando:

source: When you make changes and commit in that subdirectory, the superproject notices that the HEAD there has changed and records the exact commit you’re currently working off of; that way, when others clone this project, they can re-create the environment exactly.
es: Cuando se realizan y confirman cambios en esa subcarpeta, el proyecto padre detecta el cambio en HEAD y almacena la confirmación de cambios concreta en la que se esté trabajando en ese momento. De esta forma, cuando otras personas clonen este proyecto, sabrán cómo recrear exactamente el entorno.

source: You can see how powerful this technique can be for customized applications.
es: Esta es una muestra de lo poderosa que puede resultar esta técnica para aplicaciones personalizadas.

source: For example, say you have some test files in a `test/` subdirectory, and it doesn’t make sense to include them in the tarball export of your project.
es: Por ejemplo, digamos que tienes algunos archivos de pruebas en la carpeta 'test/', y que no tiene sentido incluirlos en los archivos comprimidos (tarball) al exportar tu proyecto.

source: remote: Compressing objects: 100% (1534/1534), done.
es: remote: Compressing objects: 100% (1534/1534), done.remote: Compressing objects: 100% (1534/1534), done.

source: This section will cover some of these scenarios.
es: En ese apartado vamos a ver algunos de esos escenarios.

source: It should be fairly straightforward to determine which solution or combination of solutions is appropriate for you and your organization.
es: No te será dificil el determinar cual de estas soluciones o combinación de soluciones es apropiada para tí y para tu organización.

source: The entire output of this process looks like this:
es: La salida completa de todo el proceso es algo como esto:

source: Another common case is that you forgot to run `git config` to set your name and e-mail address before you started working, or perhaps you want to open-source a project at work and change all your work e-mail addresses to your personal address.
es: Otra utilidad típica para utilizar `filter-branch` es cuando alguien ha olvidado ejecutar `git config` para configurar su nombre y dirección de correo electrónico antes de comenzar a trabajar. O cuando se va a pasar a código abierto un proyecto, pero previamente se desea cambiar todas las direcciones de correo empresariales por direcciones personales.

source: ## Rewriting History ##
es: ## Reescribiendo la historia ##

source: you have to use
es: tenemos que utilizar

source: Now, your Git database conceptually looks something like Figure 9-4.
es: En estos momentos, tu base de datos Git se parecerá conceptualmente a la figura 9-4.

source: The easiest way to integrate the branches, as we’ve already covered, is the `merge` command.
es: La manera más sencilla de integrar ramas, tal y como hemos visto, es el comando 'git merge'.

source: If you examine the log of a rebased branch, it looks like a linear history: it appears that all the work happened in series, even when it originally happened in parallel.
es: Si examinas el registro de una rama reorganizada, este aparece siempre como un registro lineal: como si todo el trabajo se hubiera realizado en series, aunque realmente se haya hecho en paralelo.

source: There are a couple of minor differences in the configuration file; but for your purpose, this is close to the same thing.
es: Realmente hay un par de pequeñas diferencias en el archivo de configuración; pero, a efectos prácticos es casi lo mismo.

source: A benefit of this approach is that you can more specifically define the relationships between the projects with tags and branches in the superprojects.
es: Un beneficio que se obtiene de esta manera de trabajar es la mayor especificidad en las relaciones entre proyectos, definidas mediante etiquetas (tag) y ramas (branch) en el proyecto padre.

source: Now, let’s add a new project for you.
es: A partir de ahora, puedes añadir nuevos proyectos.

source: Then, you can directly import the key into the Git database by exporting it and piping that through `git hash-object`, which writes a new blob with those contents into Git and gives you back the SHA-1 of the blob:
es: Tras esto, puedes importar directamente la clave en la base de datos Git, exportandola y redirigiendola a través del comando 'git hash-object'. Para, de esta forma, escribir un nuevo objeto dentro de Git y obtener de vuelta la firma SHA-1 de dicho objeto.

source: If you only want to modify your last commit message, it’s very simple:
es: Cambiar el mensaje de la última confirmación de cambios, es muy sencillo:

source: Again, this is for unauthenticated read-only access.
es: Aunque, sigue siendo solo para acceso unicamente de lectura y sin autentificar.

source: ### Tagging Your Releases ###
es: ### Marcando tus lanzamientos de versiones ###

source: You can insert any kind of content into it, and it will give you back a key that you can use to retrieve the content again at any time.
es: Cuando insertas cualquier tipo de contenido, él te devuelve una clave que puedes utilizar para recuperar de nuevo dicho contenido en cualquier momento.

source: When Git merges, it looks at what it has to merge together and then chooses an appropriate merging strategy to use.
es: Cuando Git realiza una fusión, suele revisar lo que ha de fusiónar entre sí y, tras ese análisis, elige la estratégia mas adecuada para hacerlo.

source: When you run commands like `git branch (branchname)`, Git basically runs that `update-ref` command to add the SHA-1 of the last commit of the branch you’re on into whatever new reference you want to create.
es: Cuando lanzas comandos como `git branch (nombrederama)`. Lo que hace Git es añadir, a cualquier nueva referencia que vayas a crear, el valor SHA-1 de la última confirmación de cambios en esa rama.

source: For example, if this patch was applied from the mbox example I just showed, the commit generated would look something like this:
es: Por ejemplo, si consideramos el parche incorporado desde el mbox del ejemplo que acabamos de mostrar; la confirmación de camios (commit) generada será algo como:

source: Git adds standard conflict-resolution markers to the files that have conflicts, so you can open them manually and resolve those conflicts.
es: Git añade a los archivos conflictivos unos marcadores especiales de resolución de conflictos. Marcadores que te guiarán cuando abras manualmente los archivos implicados y los edites para corregirlos.

source: Your history after merging in dumbidea and iss91v2.
es: El registro tras fusionar 'dumbidea' e 'iss91v2'.

source: This pulls the same change introduced in `e43a6`, but you get a new commit SHA-1 value, because the date applied is different.
es: Esto introduce exactamente el mismo cambio introducido por 'e43a6', pero con un nuevo valor SHA-1 de confirmación; ya que es diferente la fecha en que ha sido aplicado.

source: And you did all that with simple `branch` and `checkout` commands.
es: Y todo ello simplemente con dos comandos: 'git branch' y 'git checkout'.

source: It shows you what commit was the last to modify each line of any file.
es: Esta suele mostrar la confirmación de cambios (commit) que modificó por última vez cada una de las líneas en cualquiera de los archivos.

source: Git then creates a commit object that has the metadata and a pointer to the root project tree so it can re-create that snapshot when needed.
es: Después, Git crea un objeto de confirmación con los metadatos pertinentes y un apuntador al nodo correspondiente del árbol de proyecto. Esto permitirá poder regenerar posteriormente dicha instantánea cuando sea necesario.

source: After a few seconds, you’re taken to your new project page, which indicates that this project is a fork of another one (see Figure 4-15).
es: Tras unos segundos, serás redirigido a la página del nuevo proyecto; y en ella se verá que este proyecto es una bifuración (fork) de otro existente (ver Figura 4-15).

source: Git provides a safer command to do this if you want to update a reference called `update-ref`:
es: Git suministra un comando mucho más seguro para hacer esto. Si necesitas actualizar una referencia, puedes utilizar el comando `update-ref`:

source: Insert 18333fig0410.png Figure 4-10.
es: Insert 18333fig0410.png Figura 4-10.

source: SVN- or CVS-style keyword expansion is often requested by developers used to those systems.
es: Algunos usuarios de sistemas SVN o CVS, hechan de menos el disponer de expansiones de palabras clave al estilo de las que dichos sistemas tienen.

source: Whenever you make changes to the `gitosis-admin` project, you have to commit the changes and push them back up to the server in order for them to take effect:
es: Cada cambio en el proyecto 'gitosis-admin', lo has de confirmar (commit) y enviar (push) de vuelta al servidor, para que tenga efecto sobre él:

source: In this case, you can see your missing commit after the dangling commit.
es: En este caso, puedes ver la confirmación de cambios perdida en la línea 'dangling commit.....'.

source: Insert 18333fig0407.png Figure 4-7.
es: Insert 18333fig0407.png Figura 4-7.

source: It won’t create a commit for you — after running it, you must stage and commit the changes introduced manually.
es: Nunca creará una confirmación de cambios (commit) por tí, --tras ejecutar el comando, tendrás que preparar (stage) y confirmar (commit) manualmente todos los cambios introducidos--.

source: If you really wanted to, you could remove the object completely by running `git prune --expire`.
es: Si realmente quieres acabar del todo, puedes lanzar la orden `git prune --expire` para retirar incluso ese archivo suelto.

source: John isn’t allowed to push because Jessica has pushed in the meantime.
es: John no puede enviar porque Jessica ha enviado previamente.

source: They take the form `(remote)/(branch)`.
es: Suelen referenciarse como '(remoto)/(rama)'.

source: I’ll go over the strengths and possible weaknesses of each design; you can choose a single one to use, or you can mix and match features from each.
es: Vamos a repasar las fortalezas y posibles debilidades de cada paradigma. En tu trabajo, podrás elegir solo uno concreto, o podrás mezclar escogiendo funcionalidades concretas de cada uno.

source: Here, we’re assuming that you have wildcard DNS set up to send `*.gitserver` to whatever box you’re using to run all this:
es: Aquí, estamos asumiendo que tienes un DNS comodin para redirigir '*.gitserver' hacia cualquier máquina que estés utilizando para todo esto:

source: You aren’t encouraged to directly edit the reference files.
es: No es conveniente editar directamente los archivos de referencia.

source: If you’re using it only within your corporate network, SSH may be the only protocol you need to deal with.
es: Si lo usas únicamente dentro de tu red corporativa, posiblemente sea SSH el único procolo que tengas que emplear.

source: The last thing to keep in mind is the commit message.
es: Y, por último, prestar atención al mensaje de confirmación.

source: Insert 18333fig0309.png Figure 3-9.
es: Insert 18333fig0309.png Figura 3-9.

source: Next, you have two more objects to retrieve — `cfda3b`, which is the tree of content that the commit we just retrieved points to; and `085bb3`, which is the parent commit:
es: Tras esto, ya tienes más objetos a recuperar --el árbol de contenido `cfda3b` al que apunta la confirmación de cambios; y la confirmación de cambios padre `085bb3`--.

source: Now your `rack` subdirectory is at the exact state it was in when you committed earlier.
es: Tras esto, la carpeta `rack` sí que está exactamente en el estado que le corresponde estar tras la última confirmación de cambios que se realizó sobre ella.

source: To merge this work into your current working branch, you can run `git merge origin/serverfix`.
es: Para integrar (merge) esto en tu actual rama de trabajo, puedes usar el comando 'git merge origin/serverfix'.

source: If you did an import from another system or otherwise find that your repository is much larger than it should be, here is how you can find and remove large objects.
es: Si, tras una importación de otro sistema, o por otras razones, descubres que tu repositorio es mucho mayor de lo que deberia ser. Es momento de buscar y borrar objetos enormes en él.

source: It lists the oldest at the top, rather than the newest, because that’s the first one it will replay.
es: En la lista se ven las mas antiguas encima, en lugar de las más recientes, precisamente porque esas van a ser las primeras en reaplicarse.

source: To change that default to something else, you can use the `core.editor` setting:
es: Para cambiar ese comportamiento, puedes utilizar el ajuste 'core.editor':

source: Insert 18333fig0324.png Figure 3-24.
es: Insert 18333fig0324.png Figura 3-24.

source: ### Squashing a Commit ###
es: ### Combinar varias confirmaciones en una sola ###

source: Here, the `9bc1d` blob, which if you remember was the first version of your repo.rb file, is referencing the `05408` blob, which was the second version of the file.
es: Puedes observar que el objeto binario `9bc1d`, (correspondiente a la primera versión de tu archivo repo.rb), tiene una referencia al binario `05408` (la segunda versión de ese archivo).

source: For instance, the Linux kernel recently jumped from 8 to 10 characters to ensure SHA-1 object uniqueness, so older `git describe` output names were invalidated.
es: Por ejemplo, el kernel de Linux ha saltado recientemente de 8 a 10 caracteres, para asegurar la unicidad de los objetos SHA-1; dando como resultado que los nombres antiguos de 'git describe' han dejado de ser válidos.

source: Insert 18333fig0505.png Figure 5-5.
es: Insert 18333fig0505.png Figura 5-5.

source: ### Installing a Hook ###
es: ### Instalando un punto de enganche ###

source: However, occasionally Git packs up several of these objects into a single binary file called a packfile in order to save space and be more efficient.
es: Pero, sin embargo, de vez en cuando, Git suele agrupar varios de esos objetos en un único binario denominado archivo "empaquetador". Para ahorrar espacio y hacer así más eficiente su almacenamiento.

source: Git aborts the patch if this script exits non-zero.
es: Git abortará la aplicación del parche si este script termina con un código de salida distinto de cero.

source: Instructions for a new repository.
es: Instrucciones para un nuevo repositorio.

source: Perhaps you accidentally committed a file that contained a password, and you want to make your project open source.
es: O podria suceder que se haya confirmado y almacenado accidentalmente un archivo que contiene una contraseña importante, Y el proyecto se va a hacer de código abierto.
